{
  "Title": "Hunter Expansion",
  "Description": "[h1]Introduce [/h1]\r\nAdded six perform dreams and a new ending (including two branches) for the Hunter. Created the basic behavior of NSH and few rooms in his superstructure. Added NSH\u0027s transcription in [Collection].\r\nThis mod I inscribe to my friends. It does not represent any official settings or plot. I made it because my friends hope to see NSH in the game. I hope you like this mod.\r\nRegions and rooms are not something I am good at or want to create, please do not have too many expectations in this area. (Quaeledy)\r\n\r\n\r\n[h1]Credits [/h1]\r\n[h3]Code: [/h3]\r\nQuaeledy (vast majority of code)\r\nHarvie ([spoiler]the green light effect on the fixed pearl[/spoiler], a bug fix)\r\n[h3]Rooms: [/h3]\r\nQuaeledy\r\n[h3]Art: [/h3]\r\nFlunaky-Azu (most scenes)\r\nQuaeledy (refinement of NSH landscape)\r\n[h3]Sound Effects: [/h3]\r\nFlunaky-Azu\r\n[h3]Text: [/h3]\r\nIcy (the first draft of the vast majority of texts)\r\nQuaeledy (most text modifications, initial draft of a few texts)\r\nFlunaky-Azu (modifications to a small portion of the text, initial draft of a few texts)\r\n[h3]Translation: [/h3]\r\nExodus (English)\r\n[h3]Proofreading: [/h3]\r\nJun (proofreading of English text)\r\nMiaomiao (proofreading of English text)\r\n玲兰  (proofreading of Chinese text)\r\n[h3]Other:[/h3]\r\nFinally, special thanks to Harvie and Pkuyo for their help. Thanks to those who participated in the testing, they are: Fei; MoseYanyun; 静夜; closer; Fi; xue_wan; Nineteen reincarnations; 羸偶; PURE; ELNINO。\r\n\r\n\r\n[h1]Known issues: [/h1]\r\n1.This mod conflicts with Desication. Leaving NSH\u0027s room will cause the game to crash. \r\n2. In [Collection], if you unlock all collections in MSC settings and click on the broadcast of NSH region that was not collected in the game, it will cause the game to crash. (This seems to be an issue from CRS)\r\n3. When using the Warp Menu to teleport to the SB-OE karma gate, attempting to teleport to the gate in the OE region before attempting to teleport to the gate in the SB region will cause the game to report an error and fail to teleport.\r\n4. This mod also considers Lancer\u0027s hunter as the Hunter. \r\n5. Gates Scanner will cause [spoiler]a pearl in a performance of this mod to move to the wrong position[/spoiler], but this is not very important.\r\n6. When viewing the map of NSH region in the [Region] menu, the slugcat avatar will display incorrectly.\r\n7. When both Guardian and Palette Creator are enabled simultaneously, an error will be reported, but it will not affect the game process.\r\n8. Sometimes, when you have played for too long, the game may crash when playing the new ending scenes. Afterwards, you can reopen the game and continue playing normally, although you may miss the scenes of the new ending.\r\n9. The reason is not yet clear, however, Slugcats whose OE has collapsed may not be able to trigger the road to NSH. It may be related to mod conflicts.\r\n\r\n\r\n[h1]Bug Fix: [/h1]\r\n1. Some translation errors have been corrected.\r\n2. Fixed the issue where swallowing a pearl in the second dream caused the game to crash.\r\n3. Fixed the issue where players who were killed by NSH would be killed by NSH if they entered any save again.\r\n4. Fixed some issues that occurred on Daddy Long Legs.\r\n5. Fixed an issue where entering a room containing SuperStructure Fuses but not belonging to any region would cause the game to freeze.\r\n\r\n\r\n[h1]Notes: [/h1]\r\n1. I am considering modifying the English translation first, and after the English modification is completed, I will add translations from other languages. This requires your help, if you are willing (because I am not familiar with other languages). (Good news: Someone is already helping to modify the English translation!)\r\n2. Until a reasonable setting is obtained, I will not consider allowing other slugcats to reach NSH temporarily (although you can indeed find that I have done related content when using Warp Menu to reach NSH)\r\n3. This mod can be used in both v1.9.07b and v1.9.15 of the game. \r\n[b]If you are in version 1.9.15, it is best to re subscribe to this mod and its predecessor mods to ensure updates. Additionally, it is best to disable this module first and then reapply it.[/b] I\u0027m not sure how many bugs it has now. If you encounter a bug, please let me know. [b]Additionally, without exceptionLog.txt (see Bug Reports), I would hardly be able to do anything about the bugs.[/b]\r\n\r\n\r\n[h1]Updates: [/h1]\r\n[h3][2024.6.5] ver 1.0.8[/h3]\r\n1. Updated the English translation text.\r\n2. Rewrote the method of reading conversations. Now NSH can support custom conversations for mod slugcats, and if you want to see an example, please check the text folder of The Outsider.\r\n[h3][2024.10.27] ver 1.1.0[/h3]\r\n1. Added a method to go to NSH for Slugcats after Hunter. (only in story mode now)\r\n(Tip: For Slugcats whose OE has not collapsed, [spoiler]use the fixed pearl to pass through the SB-OE gate.[/spoiler] For Slugcats whose OE has collapsed, [spoiler]jump off the cliff.[/spoiler])\r\n2. Added behavior and dialogue for NSH when Hunter carries Slugpup.\r\n3. Enriched NSH\u0027s behavior. For example, the behavior of closing eyes after NSH has been ascended has been added.\r\n4. Distinguish neurons for NSH, and add Moon\u0027s interpretation of NSH neurons.\r\n5. Added NSH\u0027s interpretation of Moon\u0027s neurons, FP\u0027s neurons, FlyLure (Batnip), and SporePlant (Beehive).\r\n6. Added the reaction of NSH when players eat neurons in front of NSH.\r\n7. Allow adding custom mod Pearl dialogues for NSH.\r\n8. Added interpretation of the aquamarine pearl in the timeline of other slugcats for Moon.\r\n9. Added NSH response to players throwing Singularity Bomb.\r\n10. Some bug fixes.\r\n(Attention: Some of the new content is translated into English using machine translation, which may result in biased meanings. Subsequent updates will correct this.)",
  "ID": "Quaeledy.hunterexpansion",
  "Version": "1.1.2",
  "TargetGameVersion": "v1.9.15",
  "Requirements": "emgtx,moreslugcats,crs",
  "RequirementNames": "EmgTx,More Slugcat Expansion,Custom Regions Support",
  "Authors": "Quaeledy",
  "Visibility": "Public",
  "Tags": [
    "Campaigns"
  ],
  "WorkshopID": 3186608452,
  "UploadFilesOnly": true
}